# Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким
# финансовым результатом работает фирма. Например, прибыль — выручка больше издержек,
# или убыток — издержки больше выручки. Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки. Это отношение
# прибыли к выручке. Далее запросите численность сотрудников фирмы и определите прибыль
# фирмы в расчёте на одного сотрудника.

revenue = float(input('Введите значение выручки за период:'))
costs = float(input('Введите значение издержек за период:'))
balance = revenue - costs

if balance > 0:
    print(f'Фирма сработала с прибылью за период, равной: {balance:.2f} ')
    profit_margin = balance / revenue * 100
    print(f'Рентабельность выручки составила: {profit_margin}%')
    empl_number = int(input('Введите число сотрудников фирмы:'))
    empl_profit = balance / empl_number
    print(f'Прибыль на одного сотрудника составила: {empl_profit:2f}')
elif balance < 0:
    print(f'Фирма сработала с убытком за период, равным: {balance:.2f} ')
else:
    print('Фирма сработала в ноль')
