# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a
# километров. Каждый день спортсмен увеличивал результат на 10% относительно
# предыдущего. Требуется определить номер дня, на который результат спортсмена составит не
# менее b километров. Программа должна принимать значения параметров a и b и выводить
# одно натуральное число — номер дня.

a = float(input('Введите значение а км, равное результату спортсмена в первый день:'))
b = float(input('Введите значение b км, равное желаемому результату:'))

current_result = a
days = 1

while current_result <= b:
    current_result = current_result * 1.1
    days += 1
print(f'Номер дня на котором результат спортсмена составит не менее b километров: {days}')
