# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт
# проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list_for_checking = [1, 2, 6.56, True, [1, 2, 3], (True, False, 'unknown'), 'string']

for i in range(len(list_for_checking)):
    print(f'{list_for_checking[i]} является {type(list_for_checking[i])}')
