# Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое
# слово с новой строки. Строки нужно пронумеровать. Если слово длинное, выводить только
# первые 10 букв в слове.

sentence = input('Введите строку из нескольких слов, разделённых пробелами:')

word_list = sentence.split()

for ind, word in enumerate(word_list, 1):
    print(f'{ind}. {word:.10}')
