# Реализовать структуру «Рейтинг», представляющую собой набор натуральных чисел, который
# не возрастает. У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге
# существуют элементы с одинаковыми значениями, то новый элемент с тем же значением
# должен разместиться после них.

raiting_numbers = [9, 8, 5, 3, 2]

number = int(input('Введите элемент рейтинга:'))

raiting_numbers.append(number)
raiting_numbers.sort(reverse=True)
print(raiting_numbers)
