# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их
# деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на
# ноль.

def divide_numbers(a, b):
    try:
        c = a / b
        return c
    except ZeroDivisionError:
        print('Деление на ноль!!!')


number_1 = float(input('Введите первое число:'))
number_2 = float(input('Введите второе число:'))

print(f'Результат деления первого числа на второе равен:{divide_numbers(number_1, number_2)}')
