# Программа запрашивает у пользователя строку чисел, разделённых пробелом. При нажатии
# Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
# разделённых пробелом и снова нажать Enter. Сумма вновь введённых чисел будет
# добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введён после нескольких чисел, то вначале нужно добавить сумму
# этих чисел к полученной ранее сумме и после этого завершить программу.

def summizer():
    nums_sum = 0

    while True:

        user_nums = input('Введите строку чисел разделенных пробелом:')
        user_nums = user_nums.split()

        for i in range(len(user_nums)):

            if user_nums[i].isdigit():
                nums_sum += float(user_nums[i])
            else:
                print('Неккоректно введены данные!')
                print(f'Сумма чисел:{nums_sum}')
                return
        print(f'Сумма чисел:{nums_sum}')


summizer()
