# Реализовать два небольших скрипта:
# ● итератор, генерирующий целые числа, начиная с указанного;
# ● итератор, повторяющий элементы некоторого списка, определённого заранее.
# © geekbrains.ru 20
# Подсказка: используйте функцию count() и cycle() модуля itertools. Обратите внимание, что
# создаваемый цикл не должен быть бесконечным. Предусмотрите условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3. При достижении числа 10 —
# завершаем цикл. Вторым пунктом необходимо предусмотреть условие, при котором
# повторение элементов списка прекратится.

from itertools import cycle
from sys import argv

my_list = [1, 2, 3, 5, 7]


def loop_items(num_stop, iter_values=my_list):
    c = 0
    for i in cycle(iter_values):
        if c > num_stop:
            return
        else:
            yield i
            c += 1


name, num_stop = argv

items = loop_items(int(num_stop))

for i in items:
    print(i)
