# Создайте собственный класс-исключение, обрабатывающий ситуацию деления на ноль.
# Проверьте его работу на данных, вводимых пользователем. При вводе нуля в качестве
# делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.

class MyExeption(Exception):
    def __init__(self, er_text):
        self.text = er_text




try:
    num_1 = float(input('Введите первое число:'))
    num_2 = float(input('Введите второе число:'))
    if num_2 == 0:
        raise MyExeption('Делитель равен нулю. Деление на ноль недопустимо!')
    dev = num_1 / num_2

except MyExeption as err:
    print(err)

else:
    print(f'Результат: {round(dev, 2)}')

finally:
    print(f'Работа программы звершена.')


