# Создайте собственный класс-исключение, который должен проверять содержимое списка на
# наличие только чисел. Проверить работу исключения на реальном примере. Запрашивать у
# пользователя данные и заполнять список необходимо только числами. Класс-исключение
# должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока
# пользователь сам не остановит работу скрипта, введя, например, команду «stop». При этом
# скрипт завершается, сформированный список с числами выводится на экран.
# Подсказка: для этого задания примем, что пользователь может вводить только числа и строки.
# Во время ввода пользователем очередного элемента необходимо реализовать проверку типа
# элемента. Вносить его в список, только если введено число. Класс-исключение должен не
# позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
# При этом работа скрипта не должна завершаться.

class OnlyNumbers(Exception):
    def __init__(self, num, num_list):
        self.num_list = num_list
        self.num = num
        self.cheking_num()

    def cheking_num(self):
        if str(self.num).isdigit():
            self.num_list.append(int(self.num))
        else:
            print(f'Введено не число!')


def add_only_nums():
    num = ''
    num_list = []
    while num != 'stop':
        try:
            num = input('Введите число:')
            raise OnlyNumbers(num, num_list)
        except:
            pass
    return f'Список введённых чисел:{num_list}'


test = add_only_nums()

print(test)
